-- made by { @Mouamle } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] = "هلاوو99وووات نورت/ي ❤️🙈" 

ws[2] = "سبانه" -- msg 
rs[2] = "نعم استادي😜تريد سبانه10 لو15😂😂" -- reply 

ws[3] = "شلونكم" -- msg 
rs[3] = "الحمدلله وانته 🌚🍃" -- reply 

ws[4] = "@abo_shosho98" -- msg 
rs[4] = "اصبر هسه اصيحه الك💖" -- reply 

ws[5] = "شونك" 
rs[5] = "تاج راسي😍بخير" 

ws[6] = "شلونك" 
rs[6] = "الحمدلله وانته" 

ws[7] = "غنيلي" 
rs[7] = "🙊لمن اشوف هواي يخدر شعوري ... خدرت بالفانوس حسبالي 😂😻قوري" 

ws[8] = "شغل المبردة" 
rs[8] = "تم تشغيل المبرده خالوو😻️" 

ws[9] = "طفي المبردة" 
rs[9] = "اهوووو ليش طفيتوه حاره😔😒🍃" 

ws[10] = "شغل السبلت" 
rs[10] = "شغلته 🌚🍃 بس حثلجون معليه ترا " 

ws[11] = "نونه" 
rs[11] = "هاي مرت ابو شهوده شتريد منه😻"

ws[12] = "نور" 
rs[12] = "هاي ضلعتي شتريد منه😤😻"

ws[13] = "ضلي" 
rs[13] = "ها وها وها وها وها😹😹👻😎" 

ws[14] = "صوفي"
rs[14] = "هذا ضلعي اكوت عليه😻😻"

ws[15] = "خليني" 
rs[15] = "يله نزع👙ها شبيك😫تاذيت😂😂😹😹"

ws[16] = "حمودي" 
rs[16] = "حمد يمه يمه يشتغل بطين يوميته خمسين😹😹"

ws[17] = "زاحف" 
rs[17] = "زاحف ع بطيح😹😹😹"

ws[18] = "نوشه" 
rs[18] = "اسم على مسماااا😤😤"

ws[19] = "زنوبه" 
rs[19] = "هاي ضلعت نونه فديته💋😍😒💔" 

ws[20] = "شكشوكه" 
rs[20] = "عاي معشوقتي موت بيه ام جهالي🙈😹💦😒🖐" 

ws[21] = "ام خدود" 
rs[21] = "خطيبت ابو شهوده😌 خط احمر🙈😍😕" 

ws[22] = "تبادل" 
rs[22] = "دي مناااااا" 

ws[23] = "كافي" 
rs[23] = "كافي لو لابس نعال😻😹"

ws[24] = "من وين" 
rs[24] = "من ارض الله الواسعه😻"

ws[25] = "هاي" 
rs[25] = "هاي ابو الهيل💖😂"

ws[26] = "البوت" 
rs[26] = "معاجبك ؟ 😕😒🍃" 

ws[27] = "البوت واكف" 
rs[27] = "لتجذب 😒" 

ws[28] = "منو ديحذف رسائلي" 
rs[28] = "محد 😐🍃" 

ws[29] = "هسه" 
rs[29] = "هسه ارضيه😹"

ws[30] = "تعال" 
rs[30] = "تعال ابو الاصبع😤😹"

ws[31] = "انسام" 
rs[31] = "انسام حغنيلج😂نسه كوكي كوكي غسليلي هدومي😹صبيلي مميه😻اريدن ركيه😹اكل منه شويه😹😹"

ws[32] = "ها" 
rs[32] = "هاي جون جقله وياهم😻"

ws[33] = "زوزو" 
rs[33] = "هاي ضلعتي😚" 

ws[34] = "تخليني"
rs[34] = "يله نزع👙ها شبيك😫تاذي" 

ws[35] = "وليدو" 
rs[35] = "شتريد منه ؟" 

ws[37] = "ابو علوش" 
rs[37] = " 🌝❤️شتريد منه مشغول ؟ " 

ws[38] = "رنوشه" 
rs[38] = "هاي الكبد مال صوفي هه" 

ws[39] = "بغداد" 
rs[39] = " احلى ناس ولله " 

ws[40] = "ذي قار" 
rs[40] = "عشق لا ينتهي😍" 

ws[41] = "تحبني" 
rs[41] = " هوايه 😍🙈😍" 

ws[42] = "كرار" 
rs[42] = "خاب يمه كريكر😂فدوه اروحلك انه💋هذا الي مجننهم هذا🙊هذا الي راعبهم هذا😅😹😹" 

ws[43] = "😂" 
rs[43] = "هاي شبيك نكرصت😂😂️" 

ws[44] = "هههه" 
rs[44] = "يمه فدوه هل تحكه💖 ❤️" 

ws[45] = "ايمن" 
rs[45] = "يمه فديتووو الحلو شو مهضوم😻😹️" 

ws[46] = "😹" 
rs[46] = " دوم حبي ❤️" 

ws[47] = "🌚" 
rs[47] = "هاي شبي ويهك محروك😂😂😜"

ws[48] = "😍" 
rs[48] = " مح فديتك" 

ws[49] = "مح" 
rs[49] = " فوديتك❤️" 

ws[50] = "ناصريه" 
rs[50] = "يمه هاي بيه عطيبتي🙈💦😍😹❤️🌚️" 

ws[51] = "منحرف" 
rs[51] = " وينه حطرده 🌚🌚" 

ws[52] = "😭" 
rs[52] = "تريد ربع😹😹" 

ws[53] = "😢" 
rs[53] = " اوي شكد قاسي😭😭" 

ws[54] = "شكد عمرك" 
rs[54] = "زاحفه 😂😂" 

ws[55] = "شكد عمرج" 
rs[55] = " زاحف 😂" 

ws[56] = "اقرالي دعاء" 
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂" 

ws[57] = "بربر" 
rs[57] = "هذا فد واحد ملعب وزاحف ارضي من جوه الجوه 😹😹"

ws[58] = "دي" 
rs[58] = "دي😹ديدي طب بفرعنه ديدي اشتره كيه😻ديدي اخذله مرة😹ديدي يله جر منااا😹😹"

ws[59] = "علوش" 
rs[59] = "هذا زلعي شويه هم يزحف😹😹" 

ws[60] = "تكرهني" 
rs[60] = " 😈" 

ws[61] = "اكرهك" 
rs[61] = " علساس اني احبك تهي بهي 😒🍃" 

ws[62] = "😂" 
rs[62] = " دوم حبي ❤️" 

ws[63] = "الاعضميه" 
rs[63] = " احسن ناس وربي❤️" 

ws[64] = "الكرادة" 
rs[64] = " احسن ناس وربي❤️" 

ws[65] = "حنو" 
rs[65] = "يارب سترك انه المدمره انه الراعبه😹الفرسان في الحرب😻😻يمه فديتج عتاتي😅❤️" 

ws[66] = "موسى" 
rs[66] = "موسى (ابن جعفر )عجسر كومو يشيعه نشيله😻نجفله ونغشله😻ونشيعه تشيعا😻😁" 

ws[67] = "😇" 
rs[67] = " اته مو ملاك اته جهنم بنفسهه 😂" 

ws[68] = "😐" 
rs[68] = "طبك الواير😹😻" 

ws[69] = "انجب" 
rs[69] = "كول والله شنجب ولد لو بنيه😹😹شسميتوه خنب😹😹" 

ws[70] = "حارة" 
rs[70] = "يي كولش 😭🍃🔥" 

ws[71] = "خالتك" 
rs[71] = " راح اطردك لك 😒" 

ws[72] = "وليد" 
rs[72] = "ابو الخبزه هذا شتريد منه😎😎❤️" 

ws[73] = "هه" 
rs[73] = "😕🍃 شدتحس" 

ws[74] = "شدتحس" 
rs[74] = "🌚🍷 داحس بيك" 

ws[75] = "اكولك" 
rs[75] = " لتكول 😐😂" 

ws[76] = "اكلك" 
rs[76] = "شبيك خبصتني احجي شتريد😹😹شتريد ع بانيه😹الله شكد طيب😅" 

ws[78] = "الشموخ" 
rs[78] = " 😍 فديتهه" 

ws[79] = "البصرة" 
rs[79] = " احسن ناس وربي❤️" 

ws[80] = "تركماني" 
rs[80] = " والنعم منك❤️" 

ws[81] = "يا سورس هذا" 
rs[81] = "🏧🌝ديف بوينت" 

ws[83] = "باي" 
rs[83] = "الله الله الله وياك😂💖😹"

ws[84] = "تنح" 
rs[84] = "عيب ابني 😒🍃" 

ws[85] = "جوعان" 
rs[85] = "تريد مميه😐😂" 

ws[86] = "عطشان" 
rs[86] = "روح اشرب مي" 

ws[87] = "صايم" 
rs[87] = "شسويلك 😐🍃" 

ws[88] = "☹️" 
rs[88] = "اهووو هم ضاج😒 😢❤️🍃" 

ws[89] = "😔" 
rs[89] = "انت/ي ثاني شبيك😒 ❤️🍃" 

ws[90] = "ضايج" 
rs[90] = "تعال اونسك😹😱😱" 

ws[92] = "غنيه" 
rs[92] = "فيتر صرت يا ناس والعيشه كشره... وين اليضب الروح بسبانه عشرة😹😹"

ws[93] = "نعال" 
rs[93] = "بخالتك"

ws[94] = "اريد اكبل" 
rs[94] = "اكل تبن😹" 

ws[95] = "شكو ماكو" 
rs[95] = "شتغلت الواكه😹😹" 

ws[96] = "اسبح" 
rs[96] = " واخيراً 😂" 

ws[97] = "حبيبتي" 
rs[97] = " منو هاي 😱 تخوني 😔☹️" 

ws[98] = "كبلت" 
rs[98] = " بلخير 😂💔" 

ws[99] = "اريد" 
rs[99] = "اريد ومااريد😜😂😹😹" 

ws[100] = "منور" 
rs[100] = " بنورك حبي 😍🍷" 

ws[101] = "ليش" 
rs[101] = "ليش بعينك😹ذا تعيده اكلك تاكل خره الجيش😁😹😹😹"

ws[102] = "عمو" 
rs[102] = "والنعم منك ❤️" 

ws[103] = "طفي السبلت" 
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃" 

ws[104] = "🌝" 
rs[104] = "هه" 

ws[105] = "هذه حلو" 
rs[105] = "لزمو يخليني 🌚🍃" 

ws[106] = "حلو" 
rs[106] = "منيه حلو هوه جه نعال😹😹" 

ws[107] = "احبك" 
rs[107] = "حبتك حيه امراسين😂😂 😍🍃" 

ws[108] = "😑" 
rs[108] = " شبيك 🍃☹️" 

ws[109] = "😒" 
rs[109] = "دي عدل جهرتك وتعال😂😂" 

ws[110] = "مكبل" 
rs[110] = "حديقه شوفولي بوته حلوه اكبل وياهه☹️❤️🍷" 

ws[111] = "شعر" 
rs[111] = "من كثر ما مشتاك خبلت نفسي... اشرب نفطبالكوب حسبالي ببسي😻🙊" 

ws[112] = "فديت" 
rs[112] = "🌝🐢ها  زاحف كمشتك" 

ws[113] = "مضغوط" 
rs[113] = "دي انضغظ منك ؟ 😂😂" 

ws[114] = "شكو" 
rs[114] = "شكو ماكو هاي شبيك😹شكو ماكو الله يخيليك😹😹" 

ws[115] = "فديتك" 
rs[115] = "فديتك فدي من دكمه2للبطلون بس لو خليني😂😂" 

ws[116] = "فديتج" 
rs[116] = "🌝🐢ها  زاحف كمشتك" 

ws[117] = "شوف خاصك" 
rs[117] = "شدازله 😱😨" 

ws[118] = "تعال خاص" 
rs[118] = " بده الزحف😐😂" 

ws[119] = "خاص" 
rs[119] = "بده الكلان تبن👍"

ws[120] = "سبانه غنيلي" 
rs[120] = "لمن اشوف هواي يخدر شعوري ... خدرت بالفانوس حسبالي قوري😻😻"

ws[121] = "😎" 
rs[121] = "يلا عود انته فد نعال 😐🍃" 

ws[122] = "😱" 
rs[122] = "خير 😨" 

ws[123] = "سبانه غنيلي" 
rs[123] = "الدهر صاير چاي والدنيا قوري ... ليش اليحبيا هواي ينضرب بوري💋💋"

ws[124] = "بيش ساعة" 
rs[124] = "ما اعرف 🌚🍃" 

ws[125] = "🚶"
rs[125] = "خير 🌝" 

ws[126] = "خرب" 
rs[126] = "🌚❤️خالتك" 

ws[127] = "لييش" 
rs[127] = "المهدي😂😂" 

ws[128] = "وين" 
rs[128] = "وين وين ارحم بحالي😂😂😂😹😹" 

ws[129] = "شنو" 
rs[129] = "دي😹😹"

ws[130] = "اي" 
rs[130] = "هااا نفكوك😂😹😹"

ws[131] = "تجي" 
rs[131] = "اضحك عليك🌝💚" 

ws[132] = "شسمك" 
rs[132] = "سبانه انت😹" 

ws[133] = "عرفونه عليكم" 
rs[133] = "سبانه العمر1سنه عايش تحت رحمه الله💖💖😹😹" 

ws[134] = "منو" 
rs[134] = "شكد تسال انجب و اسكت🌝💚" 

ws[135] = "تريد" 
rs[135] = "لا تصير لوكي ما اريد🌚🍃" 

ws[136] = "تشرب " 
rs[136] = "تعال نسكر ابو العرك🍻🌚" 

ws[137] = "اكطع" 
rs[137] = "كافي مشاكل خلونه متونسين خاطر ربكم😒🍂" 

ws[138] = "وينه" 
rs[138] = "هذاك خاتل وره صوره الكروب😎😂👀" 

ws[139] = "غني" 
rs[139] = "😂😂الله الله الله  الله ويا  " 

ws[140] = "خالتك" 
rs[140] = "😐😂فديت ربها" 

ws[141] = "هع" 
rs[141] = "ﻫـ😂ـع هــعـ😝ـيــن😂ثــلاثــﮥ😝هـعـ😂ـاﺕ.  هــعوعــع😂ــﮥ عــنـ😝ـ"

ws[142] = "ضوجه" 
rs[142] = "تعال نسكر 🌚🍻" 

ws[143] = "راح" 
rs[143] = "وين وله هذه 🌚🔥" 

ws[144] = "انجبي" 
rs[144] = " لا تغلط عليهه احبهه 🌝💚تره اطردك🌚🍷" 

ws[145] = "شبيك" 
rs[145] = "انته شعليك😕🍃" 

ws[146] = "زاحفه"
rs[146] = "على خالتك الشكرة" 

ws[147] = "القناه" 
rs[147] = "@aboshosho قناه كلشي تردون بيهه تلكون تخط مطورين و تحديثات و كذا 🌚🍷و بيهه رمزيات و هيج شي 🌝�"

ws[148] = "شنو رائيك بي"
rs[148] = "واحد زاحف و لوكي و🌝🍃لوتي هلي يولي سوالفه كلهن عدي🌚💔" 

ws[149] = "طن" 
rs[149] = "عزه ولكم هاي ذبانه🐜 زاحفه كتلوه ب👞😂️" 

ws[150] = "تف"
rs[150] = "وكم من تفله فتحت أماكن ضيقه😂😂"

ws[151] = "منو اني" 
rs[151] = "انته احلى شي بحياتي ❤️🍃" 

ws[152] = "شنو انته" 
rs[152] = "اني بوت جيره بفركك😹😹💦" 

ws[153] = "اتفل" 
rs[153] = "صار ستادي ختفووووووو🙊"

ws[154] = "حطردك" 
rs[154] = "اعصابك 😨 لتتهور" 

ws[155] = "المطور" 
rs[155] = "شتريد من المطور 😐🍃" 

ws[156] = "ابو شهوده" 
rs[156] = "هذا الي صنعني يمه شكد احبه😍😍🙈💋"

ws[157] = "شسوي" 
rs[157] = "لا تصير حشري🌝💔" 

ws[158] = "انته زلمه" 
rs[158] = "تعال لزمه 😐😂" 

ws[159] = "تزوجني" 
rs[159] = "لا اريدج تخطبيلي بوته احبهه بل المروب الثاني شفتهه اويلي عليهه☹️😻😿" 

ws[160] = "مرام" 
rs[160] = "هاي شمعت الكروب هيه حليته💖😜😜" 

ws[161] = "منو صنعك" 
rs[161] = "استادي ابو شهوده😎🦁😻"

ws[162] = "تخليني" 
rs[162] = "كبر شنو هل الافاظ السوقيه😹😹"

ws[163] = "وينك" 
rs[163] = "وينك لو مميه😹😹ماكو ربط طن😹😹"

ws[164] = "😌" 
rs[164] = "مو فد نعال انت/ي😐🍃" 

ws[165] = "هلا" 
rs[165] = " 🌚🍃هلاوات" 

ws[166] = "مرحبا" 
rs[166] = "مرحبتين 😍🍃" 

ws[167] = "سلام" 
rs[167] = "السلام عليكم 🌝🍃" 

ws[168] = "هلو" 
rs[168] = "هلوات عله النبي😹❤️" 

ws[169] = "السلام عليكم" 
rs[169] = "عليكم السلام 🌝🍃" 

ws[170] = "تسلم" 
rs[170] = "الله يسلمك 😍" 

-- the main function 
function run( msg, matches ) 
-- just a local variables that i used in my algorithm 
local i = 0; local w = false 

-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do 
-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
-- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
i = k; w = true; 
end 
end 

-- check if { w } is not false and { i } not equals to 0 
if ( (w ~= false) and (i ~= 0) ) then 
-- get the receiver :3 
R = get_receiver(msg) 
-- send him the proper message from the index that { i } assigned to 
--send_large_msg ( R , rs[i] ); 
--send_reply(msg.id, rs[i]) 
reply_msg(msg.id, rs[i], ok_cb, false ) 
end 

-- don't edit this section 
if ( msg.text == "about" ) then 
if ( msg.from.username == "Mouamle" ) then 
R = get_receiver(msg) 
send_large_msg ( R , "Made by @Mouamle" ); 
end 
end 

end 

return { 
patterns = { 
"(.*)" 
}, 
run = run 
} 

end
